discs = [
    # ['id', 'name']
    [101, 'Discrete Math'],
    [102, 'ЭВМ'],
    [103, 'Линейная алгебра'],
    [104, 'Английский язык']
]

groups = [
    # ['id', 'name']
    [201, 'M3100'],
    [202, 'M3102'],
    [203, 'М3105'],
    [204, 'АЯ-16/С1'],
    [205, 'АЯ-132в/В2.2'],
]

students = [ 
    #['id', 'name', 'number_ISU']
    [301, 'Злоделовая Марина', 333333], 
    [302, 'Сазонов Георгин', 333334],
    [303, 'Ухов Илья', 433333],
    [304, 'Струнная Екатерина', 333363],
    [305, 'Котик Андрей', 383333],
    [306, 'Ботт Борис', 333343],
    [307, 'Гениусов Гений', 336333],
]

students_in_groups = [
    # ['group_id', 'student_id']
    [201, 301],
    [201, 302],
    [201, 303],
    [201, 304],
    [202, 305],
    [202, 306],
    [203, 307],
    [204, 302],
    [204, 305],
    [205, 303]
]

teachers = [ 
    # ['id', 'name', 'number_ISU']
    [401, 'Чухарев Константин Игоревич', 666666],
    [402, 'Left Euclidian Function Biective', 000000],
    [403, 'Повыш Повыш Повыш', 555555],
    [404, 'Злоумышь Мария Александровна', 555355],
    [405, 'Блаблабланова Учительница Английскоговна', 555552],
    [406, 'Jack The Carrier', 789012]
]

group_disc = [ 
    # ['id', 'group_id', 'disc_id']
    [501, 201, 101],
    [502, 201, 102],
    [503, 201, 103],
    [504, 202, 101],
    [505, 202, 102],
    [506, 202, 103],
    [507, 203, 101],
    [508, 203, 102],
    [509, 204, 104],
    [5010, 205, 104]
]

teacher_gd = [ 
    #['teacher_id', 'group_disc_id']
    [401, 501],
    [401, 504],
    [402, 507],
    [403, 502],
    [403, 505],
    [404, 503],
    [404, 506],
    [405, 509],
    [406, 5010]
]

labs = [ 
    #['id', 'name', 'content']
    [601, '', ''],
]

lab_gd = [ 
    #['lab_id', 'gd_id', 'is_available', 'deadline']
    [,,,''],
]

del_labs = [ 
    #['id', 'student_id', 'content', 'mark', 'comm', 'date']
    [701, , '', '', '', ''],
]

lab_del_lab = [
    #['del_lab_id', 'lab_id']
    [,],
]
